Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.LoadDetailedPreviewImagePng(System.String)
Loads the detailed preview image of the connection from the file in PNG format.
filePath:
File path to use as the source of the detailed preview image. Must end with the ".png" extension.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017

Autodesk.Revit.DB.Structure.StructuralConnectionTypeInfoData.LoadPreviewImagePng(System.String)
Loads the preview image of the connection from the file in PNG format.
filePath:
File path to use as the source of the preview image. Must end with the ".png" extension.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2017